[
  {
    "path": "posts/2025-07-19-poLCA/",
    "title": "poLCA: Starting values for Class Prevalence Probabilities",
    "description": "Sometimes maybe less is more..",
    "author": [
      {
        "name": "Jessica",
        "url": {}
      }
    ],
    "date": "2025-07-19",
    "categories": [
      "research"
    ],
    "contents": "\nIntroduction\nThis post assumes familiarity with latent class models. [Here] is an intro if you aren’t.\nWhen estimating latent class models, starting values are needed to get the estimation algorithm going. When I first learned about latent class models, I came across this R package poLCA\nMotivation\n\n\n\n\n\n\nFirst off, let’s get one thing out of the way. Neither of these two models\nWhat I Did\nResults\nConclusion\n\n\n\n",
    "preview": "posts/2025-07-19-poLCA/Rplot1.png",
    "last_modified": "2025-07-19T01:54:32-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2025-07-18-welcome-again/",
    "title": "My First Post (PhD verison)",
    "description": "It's been 4 years since my last post! I still don't know how to use git",
    "author": [
      {
        "name": "Jessica",
        "url": {}
      }
    ],
    "date": "2025-07-18",
    "categories": [
      "food",
      "research"
    ],
    "contents": "\nHowdy! It’s been a while since I last tried to start up this blog again. I want to practice writing up and sharing some of my research I’ve been working on for the past 3 (!!!!) years. The last time I wrote here I was still a wee little undergraduate student who had 0 idea about grad school and alas… here we are.\nIt took me a long time to get to the research topics that I’m interested in now. I started my program not even knowing what latent class models are, so I’d like to think I worked myself from the ground up! Broadly, I am interested in digging deeper into measurement models that psychology researchers use. My own personal theory is that the ease of software allows researchers to run extremely complex models with just one line of code and return results in a matter of seconds, leading many to believe that the models are easy to compute and extract values. Most of the time these models are extremely challenging to estimate, and software programs makes a lot of choices that researchers don’t about, which can impact their results! One choice in particular is the estimation algorithm used to obtain parameter estimates. My current work, which I will detail in a separate post, compares how two different estimation algorithms result in different solutions for the same model and same dataset!\nThe model I’m focusing on at the moment is latent class models! Latent class models aim to characterize individuals in a sample into different groups, where each group differs on some unobserved (latent) variable. Latent class models have been used in substance research, education, and so much more. Pretty much every field I’ve encountered in research will have at least 1-2 papers using latent class models. Latent class models differ from machine learning methods that also aim to classify people into groups (k-means clustering) in that the items or predictors are assumed to have measurement error. We assume that the thing (or latent variable) that distinguishes different groups is unobservable, and that our items are just an approximation of the real thing. Examples include depression, alcohol dependence, burnout, and disordered eating.\nMore specifically, here are some of the topics I’m interested in and what I hope to write articles on…\nDo Newton-Raphson and Expectation-Maximization Algorithms traverse the latent class likelihood surface in the same way?\nDo different types of parameter restrictions (equality, inequality, bounds) impact estimation of latent class models in different ways?\nSome less fleshed out research ideas include..\nSimulated annealing + genetic algorithms and how they compare to traditional algorithms\nstart value quality\nMy first article will be how starting values are generated for a popular R package poLCA. Please stay tuned.\nOf course it wouldn’t be me if I didn’t talk about food..I wanted to highlight a new spot in Seattle I really like called Many Bennies. They serve New Zealand style ice cream where they blend your choice of fruits with a sweet cream base! It tastes like no other ice cream that I’ve ever had before. It has the lightness of frozen yogurt but it’s creamy and not tart at all! After eating this ice cream I realize how insanely sweet traditional ice cream places are…I’m not even a huge fruit fan but after trying this place I can never go back to Ben and Jerrys or Molly Moons haha. I got blueberries and strawberries and it was the perfect combination. They also give free lactaid which is super cool!\n\n\n\nIf you made it this far, thanks for reading. Take care!\nJessica\n\n\n\n",
    "preview": {},
    "last_modified": "2025-07-19T00:44:13-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-08-11-my-first-post/",
    "title": "My First Post",
    "description": "I'm really struggling with the distill package! And git commands!",
    "author": [
      {
        "name": "Jessica",
        "url": {}
      }
    ],
    "date": "2021-08-11",
    "categories": [],
    "contents": "\nI spent about 1 hour deleting and cloning and merging different repositories.. instead of properly learning git commands I’ve been relying on the integrated git feature in RStudio.\n\n\n\n",
    "preview": {},
    "last_modified": "2025-07-18T23:03:35-07:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Crouton Thoughts",
    "description": "The world needs to hear what I have to say!",
    "author": [
      {
        "name": "Jessica",
        "url": "https://github.com/jeyu22"
      }
    ],
    "date": "2021-08-11",
    "categories": [],
    "contents": "\n\n\n\nHi! My name is Jessica. I’m a senior at Amherst College studying statistics and psychology. I made this blog for fun in hopes of motivating myself to be a more active programmer and data scientist! I love R and #TidyTuesday. Besides statistics I enjoy finding new places to eat in the D.C/Maryland/Virginia area.\nHere’s a list (mainly for myself) of posts I want to make in the next few months:\nRatings of all the restaurants/cafes I’ve tried (ideally on a leaflet plot…)\nFood reviews…\nTidy Tuesday challenges\nSide projects..\nI’m also writing a statistics thesis this upcoming fall, so hopefully I’ll post updates as that progresses!\nWhy croutons?\nThey’re versatile: as a topping for salad, a tasty snack, or an entire meal. My favorite croutons are the ones that come with the caesar salad at Costco.\n\n\n\n",
    "preview": {},
    "last_modified": "2025-07-18T23:24:33-07:00",
    "input_file": {}
  }
]
