[
  {
    "path": "posts/2025-07-18-poLCA/",
    "title": "poLCA: Starting values for Class Prevalence Probabilities",
    "description": "It's been 4 years since my last post! I still don't know how to use git",
    "author": [
      {
        "name": "Jessica",
        "url": {}
      }
    ],
    "date": "2025-07-18",
    "categories": [
      "food",
      "research"
    ],
    "contents": "\nR Markdown\nThis is an R Markdown document. Markdown is a simple formatting syntax for authoring HTML, PDF, and MS Word documents. For more details on using R Markdown see http://rmarkdown.rstudio.com.\nWhen you click the Knit button a document will be generated that includes both content as well as the output of any embedded R code chunks within the document. You can embed an R code chunk like this:\n\n\nsummary(cars)\n\n     speed           dist       \n Min.   : 4.0   Min.   :  2.00  \n 1st Qu.:12.0   1st Qu.: 26.00  \n Median :15.0   Median : 36.00  \n Mean   :15.4   Mean   : 42.98  \n 3rd Qu.:19.0   3rd Qu.: 56.00  \n Max.   :25.0   Max.   :120.00  \n\nIncluding Plots\nYou can also embed plots, for example:\n\n\n\nNote that the echo = FALSE parameter was added to the code chunk to prevent printing of the R code that generated the plot.\n\n\n\n",
    "preview": "posts/2025-07-18-poLCA/2025-07-18-poLCARmd_files/figure-html5/pressure-1.png",
    "last_modified": "2025-07-18T23:45:51-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2025-07-18-welcome-again/",
    "title": "My First Post (PhD verison)",
    "description": "It's been 4 years since my last post! I still don't know how to use git",
    "author": [
      {
        "name": "Jessica",
        "url": {}
      }
    ],
    "date": "2025-07-18",
    "categories": [
      "food",
      "research"
    ],
    "contents": "\nHowdy! It’s been a while since I last tried to start up this blog again. I want to practice writing up and sharing some of my research I’ve been working on for the past 3 (!!!!) years. The last time I wrote here I was still a wee little undergraduate student who had 0 idea about grad school and alas… here we are.\nblah\nblah\nOf course it wouldn’t be me if I didn’t talk about food..\nI wanted to highlight a new spot in Seattle I really like called Many Bennies.\n\n\n\n\n\n\n",
    "preview": {},
    "last_modified": "2025-07-18T23:36:55-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-08-11-my-first-post/",
    "title": "My First Post",
    "description": "I'm really struggling with the distill package! And git commands!",
    "author": [
      {
        "name": "Jessica",
        "url": {}
      }
    ],
    "date": "2021-08-11",
    "categories": [],
    "contents": "\nI spent about 1 hour deleting and cloning and merging different repositories.. instead of properly learning git commands I’ve been relying on the integrated git feature in RStudio.\n\n\n\n",
    "preview": {},
    "last_modified": "2025-07-18T23:03:35-07:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Crouton Thoughts",
    "description": "The world needs to hear what I have to say!",
    "author": [
      {
        "name": "Jessica",
        "url": "https://github.com/jeyu22"
      }
    ],
    "date": "2021-08-11",
    "categories": [],
    "contents": "\n\n\n\nHi! My name is Jessica. I’m a senior at Amherst College studying statistics and psychology. I made this blog for fun in hopes of motivating myself to be a more active programmer and data scientist! I love R and #TidyTuesday. Besides statistics I enjoy finding new places to eat in the D.C/Maryland/Virginia area.\nHere’s a list (mainly for myself) of posts I want to make in the next few months:\nRatings of all the restaurants/cafes I’ve tried (ideally on a leaflet plot…)\nFood reviews…\nTidy Tuesday challenges\nSide projects..\nI’m also writing a statistics thesis this upcoming fall, so hopefully I’ll post updates as that progresses!\nWhy croutons?\nThey’re versatile: as a topping for salad, a tasty snack, or an entire meal. My favorite croutons are the ones that come with the caesar salad at Costco.\n\n\n\n",
    "preview": {},
    "last_modified": "2025-07-18T23:24:33-07:00",
    "input_file": {}
  }
]
